nickless81/usb_toolbox/scilab6-dev/PIC18F4550/HID/src/usb.c
/*
 * Firmware framework for USB I/O on PIC 18F2455 (and siblings)
 * Copyright (C) 2005 Alexander Enzmann
 * adapted to MCC18 by Alberto Maccioni on 1/8/09
 * re-adapted to SDCC 2.9.0 by Enrique Olivares (EOL) on 22/06/10
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111 USA
 * or see <http://www.gnu.org/licenses/>
 */
#include <pic18fregs.h>
#include <string.h>
#include <stdio.h>
#include <usb.h>
#include <callbacks.h>

#define ALLOW_SUSPEND 0

// It appears that you need at least 6 loops that are replaced by memcpy()
// before it is an advantage.
#define USE_MEMCPY 0

// Device and configuration descriptors.  These are used as the
// host enumerates the device and discovers what class of device
// it is and what interfaces it supports.
#define DEVICE_DESCRIPTOR_SIZE 0x12
#define     CONFIG_HEADER_SIZE 0x09
#define    HID_DESCRIPTOR_SIZE 0x20
#define        HID_HEADER_SIZE 0x09

typedef struct _configStruct{
    unsigned char  configHeader [ CONFIG_HEADER_SIZE  ];
    unsigned char HIDDescriptor [ HID_DESCRIPTOR_SIZE ];
} ConfigStruct;

// Global variables
unsigned char deviceState;
unsigned char remoteWakeup;
unsigned char deviceAddress;
unsigned char selfPowered;
unsigned char currentConfiguration;

// Control Transfer Stages - see USB spec chapter 5
#define SETUP_STAGE    0 // Start of a control transfer (followed by 0 or more data stages)
#define DATA_OUT_STAGE 1 // Data from host to device
#define DATA_IN_STAGE  2 // Data from device to host
#define STATUS_STAGE   3 // Unused - if data I/O went ok, then back to Setup

unsigned char ctrlTransferStage; // Holds the current stage in a control transfer

unsigned char HIDPostProcess;    // Set to 1 if HID needs to process after the data stage
unsigned char requestHandled;    // Set to 1 if request was understood and processed.

unsigned char *outPtr;           // Data to send to the host
code unsigned char *ROMoutPtr;    // Data to send to the host
unsigned char *inPtr;            // Data from the host
unsigned int wCount;            // Number of bytes of data
unsigned char transferType;	// 0=ram 1=rom

// HID Class variables
unsigned char hidIdleRate;
unsigned char hidProtocol; // [0] Boot Protocol [1] Report Protocol
unsigned char hidRxLen;    // # of bytes put into buffer

code unsigned char deviceDescriptor[] ={
    0x12, 0x01, // bLength, bDescriptorType
    0x00, 0x02, // bcdUSB (low byte), bcdUSB (high byte)
    0x00, 0x00, // bDeviceClass, bDeviceSubClass
    0x00, E0SZ, // bDeviceProtocl, bMaxPacketSize
    0xD8, 0x04, // idVendor (low byte), idVendor (high byte)
    0x0B, 0x01, // idProduct (low byte), idProduct (high byte)
    0x01, 0x00, // bcdDevice (low byte), bcdDevice (high byte)
    0x01, 0x02, // iManufacturer, iProduct
    0x03, 0x01  // iSerialNumber (none), bNumConfigurations
};

// Total config size is 0x09 + 0x09 + 0x09 + 0x07 + 0x07 = 0x29
#define CFSZ 0x29
#define HISZ HID_INPUT_REPORT_BYTES
#define HOSZ HID_OUTPUT_REPORT_BYTES

code ConfigStruct configDescriptor ={
    {
    // Configuration descriptor
    0x09, 0x02, // bLength, bDescriptorType (Configuration)
    CFSZ, 0x00, // wTotalLength (low), wTotalLength (high)
    0x01, 0x01, // bNumInterfaces, bConfigurationValue
    0x00, 0xA0, // iConfiguration, bmAttributes ()
    0x64,       // bMaxPower
    },
    {
    // HID Interface descriptor
    0x09, 0x04, // bLength, bDescriptorType (Interface)
    0x00, 0x00, // bInterfaceNumber, bAlternateSetting
    0x02, 0x03, // bNumEndpoints, bInterfaceClass (HID)
    0x00, 0x00, // bInterfaceSubclass, bInterfaceProtocol,
    0x00,       // iInterface
    // Hid descriptor
    0x09, 0x21, // bLength, bDescriptorType (HID)
    0x01, 0x01, // bcdHID (low), bcdHID (high)
    0x00, 0x01, // bCountryCode, bNumDescriptors
    0x22, 47  , // bDescriptorType, wDescriptorLength (low)
    0x00,       // wDescriptorLength (high)
    // HID Endpoint 1 In
    0x07, 0x05, // bLength, bDescriptorType (Endpoint)
    0x81, 0x03, // bEndpointAddress, bmAttributes (Interrupt)
    HISZ, 0x00, // wMaxPacketSize (low), wMaxPacketSize (high)
    0x01,       // bInterval (1 millisecond)
    // HID Endpoint 1 Out
    0x07, 0x05, // bLength, bDescriptorType (Endpoint)
    0x01, 0x03, // bEndpointAddress, bmAttributes (Interrupt)
    HOSZ, 0x00, // wMaxPacketSize (low), wMaxPacketSize (high)
    0x01,       // bInterval (1 millisecond)
    }
};

#define HIRB HID_INPUT_REPORT_BYTES
#define HORB HID_OUTPUT_REPORT_BYTES
#define HFRB HID_FEATURE_REPORT_BYTES
#define HID_REPORT_SIZE 47 // Size is from HID Descriptor tool

code unsigned char HIDReport[HID_REPORT_SIZE] = {
    0x06, 0xa0, 0xff,  // USAGE_PAGE (Vendor Defined Page 1)
    0x09, 0x01,        // USAGE (Vendor Usage 1)
    0xa1, 0x01,        // COLLECTION (Application)

    0x09, 0x01,        //   USAGE (Vendor Usage 1)
    0x15, 0x00,        //   LOGICAL_MINIMUM (0)
    0x26, 0xFF, 0x00,  //   LOGICAL_MAXIMUM (255)
    0x75, 0x08,        //   REPORT_SIZE (8)
    0x95, 0x40,        //   REPORT_COUNT (HIRB)
    0x81, 0x02,        //   INPUT (Data,Var,Abs)

    0x09, 0x01,        //   USAGE (Vendor Usage 1)
    0x15, 0x00,        //   LOGICAL_MINIMUM (0)
    0x26, 0xFF, 0x00,  //   LOGICAL_MAXIMUM (255)
    0x75, 0x08,        //   REPORT_SIZE (8)
    0x95, 0x40,        //   REPORT_COUNT (HORB)
    0x91, 0x02,        //   OUTPUT (Data,Var,Abs)

    0x09, 0x02,        //   USAGE (Vendor Usage 1)
    0x15, 0x00,        //   LOGICAL_MINIMUM (0)
    0x26, 0xFF, 0x00,  //   LOGICAL_MAXIMUM (255)
    0x75, 0x08,        //   REPORT_SIZE (8)
    0x95, 0x40,        //   REPORT_COUNT (HFRB)
    0xB1, 0x02,        //   FEATURE (Data,Var,Abs)
    0xc0               // END_COLLECTION
};
code struct{
    unsigned char bLength;
    unsigned char bDscType;
    unsigned short string[1];
}stringDescriptor0={
    sizeof(stringDescriptor0),
    STRING_DESCRIPTOR,
    {0x0409}
};
code struct{
    unsigned char bLength;
    unsigned char bDscType;
    unsigned short string[11];
}stringDescriptor1={
    sizeof(stringDescriptor1),
    STRING_DESCRIPTOR,
    {
        'V',
        'E',
        'N',
        'D',
        'O',
        'R',
        ' ',
        'N',
        'A',
        'M',
        'E'
    }
};
code struct{
    unsigned char bLength;
    unsigned char bDscType;
    unsigned short string[12];
}stringDescriptor2={
    sizeof(stringDescriptor2),
    STRING_DESCRIPTOR,
    {
        'P',
        'R',
        'O',
        'D',
        'U',
        'C',
        'T',
        ' ',
        'N',
        'A',
        'M',
        'E'
    }
};
code struct{
    unsigned char bLength;
    unsigned char bDscType;
    unsigned short string[13];
}stringDescriptor3={
    sizeof(stringDescriptor3),
    STRING_DESCRIPTOR,
    {
        'S',
        'E',
        'R',
        'I',
        'A',
        'L',
        ' ',
        'N',
        'U',
        'M',
        'B',
        'E',
        'R'
    }
};
