nickless81/usb_toolbox/scilab6-dev/PIC18F4550/HID/src/usb.c
/*
code unsigned char stringDescriptor0[] ={
    0x04, STRING_DESCRIPTOR,
    0x09, 0x04,
};

code unsigned char stringDescriptor1[] ={
    24, STRING_DESCRIPTOR, // bLength, bDscType
    'V',0,'E',0,'N',0,'D',0,'O',0,'R',0,' ',0,'N',0,'A',0,'M',0,'E',0,
};

code unsigned char stringDescriptor2[] ={
    26, STRING_DESCRIPTOR,
    'P',0,'R',0,'O',0,'D',0,'U',0,'C',0,'T',0,' ',0,'N',0,'A',0,'M',0,'E',0,
};
code unsigned char stringDescriptor3[] ={
    28, STRING_DESCRIPTOR,
    'S',0,'E',0,'R',0,'I',0,'A',0,'L',0,' ',0,'N',0,'U',0,'M',0,'B',0,'E',0,'R',0,
};
*/
volatile BDT at 0x0400 ep0Bo; //Endpoint #0 BD Out
volatile BDT at 0x0404 ep0Bi; //Endpoint #0 BD In
volatile BDT at 0x0408 ep1Bo; //Endpoint #1 BD Out
volatile BDT at 0x040C ep1Bi; //Endpoint #1 BD In

// TBD: add definitions for additional endpoints (2-16).

// Put endpoint 0 buffers into dual port RAM
#pragma udata usbram5 SetupPacket controlTransferBuffer
volatile setupPacketStruct SetupPacket;
volatile unsigned char controlTransferBuffer[E0SZ];

// Put USB I/O buffers into dual port RAM.
#pragma udata usbram5 HIDRxBuffer HIDTxBuffer

// HID specific buffers
volatile unsigned char HIDRxBuffer[HID_OUTPUT_REPORT_BYTES];
volatile unsigned char HIDTxBuffer[HID_INPUT_REPORT_BYTES];

//
// Start of code for HID specific code.
//

/******************************************************************************/
// Send up to len bytes to the host.  The actual number of bytes sent is returned
// to the caller.  If the send failed (usually because a send was attempted while
// the SIE was busy processing the last request), then 0 is returned.

unsigned char HIDTxReport(unsigned char *buffer, unsigned char len){
#if !USE_MEMCPY
    unsigned char i;
#endif

#ifdef DEBUG_PRINT
 printf("HIDTxReport: %d\r\n", (word)len);
#endif

    // If the CPU still owns the SIE, then don't try to send anything.
    if (ep1Bi.Stat & UOWN){
        return 0;
    }

    // Truncate requests that are too large.  TBD: send 
    if(len > HID_INPUT_REPORT_BYTES){
        len = HID_INPUT_REPORT_BYTES;
    }

   // Copy data from user's buffer to dual-ram buffer
#if USE_MEMCPY
    memcpy(HIDTxBuffer, buffer, len);
#else
    for (i = 0; i < len; i++){
        HIDTxBuffer[i] = buffer[i];
    }
#endif

    // Toggle the data bit and give control to the SIE
    ep1Bi.Cnt = len;
    if(ep1Bi.Stat & DTS){
        ep1Bi.Stat = UOWN | DTSEN;
    }else{
        ep1Bi.Stat = UOWN | DTS | DTSEN;
    }

    return len;
}

/******************************************************************************/
// Read up to len bytes from HID output buffer.  Actual number of bytes put into
// buffer is returned.  If there are fewer than len bytes, then only the available
// bytes will be returned.  Any bytes in the buffer beyond len will be discarded.

unsigned char HIDRxReport(unsigned char *buffer, unsigned char len){
    hidRxLen = 0;
#ifdef DEBUG_PRINT
    printf("HIDRxReport: %d\r\n", len);
#endif
  
    // If the SIE doesn't own the output buffer descriptor, then it is safe to
    // pull data from it.
    if(!(ep1Bo.Stat & UOWN)){
        // See if the host sent fewer bytes that we asked for.
        if(len > ep1Bo.Cnt){
            len = ep1Bo.Cnt;
        }
        // Copy data from dual-ram buffer to user's buffer
#if USE_MEMCPY
        memcpy(buffer, HIDRxBuffer, len);
#else
        for(hidRxLen = 0; hidRxLen < len; hidRxLen++){
            buffer[hidRxLen] = HIDRxBuffer[hidRxLen];
        }
#endif

#ifdef DEBUG_PRINT
	printf("HIDRxReport: %d: 0x%hx 0x%hx 0x%hx 0x%hx\r\n",
        (word)len, (unsigned char)buffer[0], (unsigned char)buffer[1], (unsigned char)buffer[2], (unsigned char)buffer[3]);
#endif
        // Reset the HID output buffer descriptor so the host
        // can send more data.
        ep1Bo.Cnt = sizeof(HIDRxBuffer);
        if(ep1Bo.Stat & DTS){
            ep1Bo.Stat = UOWN | DTSEN;
        }else{
            ep1Bo.Stat = UOWN | DTS | DTSEN;
        }
    }
    return hidRxLen;    
}

/******************************************************************************/
// After configuration is complete, this routine is called to initialize
// the endpoints (e.g., assign buffer addresses).

void HIDInitEndpoint(void){
    hidRxLen =0;
#ifdef DEBUG_PRINT
    printf("HIDInitEndpoint\r\n");
#endif
    // Turn on both in and out for this endpoint
    UEP1 = 0x1E;    
    ep1Bo.Cnt = sizeof(HIDRxBuffer);
    ep1Bo.ADDR = PTR16(&HIDRxBuffer);
    ep1Bo.Stat = UOWN | DTSEN;
    ep1Bi.ADDR = PTR16(&HIDTxBuffer);
    ep1Bi.Stat = DTS;
}

/******************************************************************************/
// If the setup stage indicates that this is a GET_REPORT request, we vector
// to user supplied routines to determine what (if any) data should be sent
// back.

void HIDGetReport(void){
    unsigned char reportID = SetupPacket.wValue0;

#ifdef DEBUG_PRINT
    printf("HIDGetReport: 0x%x\r\n", (word)SetupPacket.wValue1);
#endif

    // Determine which kind of report is being requested
    if (SetupPacket.wValue1 == 0x01){
         GetInputReport(reportID);
         requestHandled = 1;
    }else if (SetupPacket.wValue1 == 0x03){
        GetFeatureReport(reportID);
        requestHandled = 1; 
    }
}

/******************************************************************************/
// Process SET_REPORT transaction.

void HIDSetReport(void){
    unsigned char reportID = SetupPacket.wValue0;
    // The report type is in the high byte of the Setup packet's Value field.
    // 3 = Feature; 2 = Output.

#ifdef DEBUG_PRINT
    printf("HIDSetReport: 0x%ux\r\n", (word)SetupPacket.wValue1);
#endif

    if (SetupPacket.wValue1 == 0x02){
        SetupOutputReport(reportID);
        requestHandled = 1; 
    }else if (SetupPacket.wValue1 == 0x03){
        SetupFeatureReport(reportID);
        requestHandled = 1;
    }
}

/******************************************************************************/
// Process HID specific requests.

void ProcessHIDRequest(void){
    unsigned char bRequest;

