nickless81/usb_toolbox/scilab6-dev/PIC18F4550/HID/src/usb.c
     // Has to be to the HID interface
    if((SetupPacket.bmRequestType & 0x1F) != 0x01 || (SetupPacket.wIndex0 != 0x00))
        return;

    bRequest = SetupPacket.bRequest;

    if (bRequest == GET_DESCRIPTOR){
        // Request for a descriptor.
        unsigned char descriptorType  = SetupPacket.wValue1;
        if (descriptorType == HID_DESCRIPTOR){
#ifdef DEBUG_PRINT
          printf("HID: HID_DESCRIPTOR\r\n");
#endif
            // HID descriptor.
            requestHandled = 1;
            outPtr = (code unsigned char *) &configDescriptor.HIDDescriptor;
            wCount = HID_HEADER_SIZE;
            transferType=1;
        }else if (descriptorType == REPORT_DESCRIPTOR){
#ifdef DEBUG_PRINT
        printf("HID: REPORT_DESCRIPTOR\r\n");
#endif
            // Report descriptor.
            requestHandled = 1;
            ROMoutPtr = (code unsigned char *)HIDReport;
            wCount = HID_REPORT_SIZE;
            transferType=1;
        }else if (descriptorType == PHYSICAL_DESCRIPTOR){

#ifdef DEBUG_PRINT
        printf("HID: PHYSICAL_DESCRIPTOR\r\n");
#endif

            // Physical descriptor.
        }else{

#ifdef DEBUG_PRINT
            printf("HID: Unsupported descriptor: 0x%x\r\n", SetupPacket.wValue1);
#endif

        }
    }
    
    if ((SetupPacket.bmRequestType & 0x60) != 0x20){
#ifdef DEBUG_PRINT
     printf("Not CLASS request: 0x%x, 0x%x\r\n", (word)(SetupPacket.bmRequestType & 0x60), (word)SetupPacket.bRequest);
#endif
        return;
    }

    // HID-specific requests.
    if (bRequest == GET_REPORT){
#ifdef DEBUG_PRINT
        printf("HID: GET_REPORT\r\n");
#endif
        HIDGetReport();
    }else if (bRequest == SET_REPORT){
#ifdef DEBUG_PRINT
        printf("HID: SET_REPORT\r\n");
#endif
        HIDPostProcess = 1;
        HIDSetReport();            
    }else if (bRequest == GET_IDLE){
#ifdef DEBUG_PRINT
        printf("HID: GET_IDLE\r\n");
#endif
        requestHandled = 1;
        outPtr = &hidIdleRate;
        wCount = 1;
        transferType=0;
    }else if (bRequest == SET_IDLE){
#ifdef DEBUG_PRINT
        printf("HID: SET_IDLE\r\n");
#endif
        requestHandled = 1;
        hidIdleRate = SetupPacket.wValue1;
    }else if (bRequest == GET_PROTOCOL){
#ifdef DEBUG_PRINT
        printf("HID: GET_PROTOCOL\r\n");
#endif
        requestHandled = 1;
        outPtr = &hidProtocol;
        wCount = 1;
	transferType=0;
    }else if (bRequest == SET_PROTOCOL){
#ifdef DEBUG_PRINT
        printf("HID: SET_PROTOCOL\r\n");
#endif
        requestHandled = 1;
        hidProtocol = SetupPacket.wValue0;
    }else{
#ifdef DEBUG_PRINT
        printf("HID: Unknown request: 0x%x\r\n", SetupPacket.bRequest);
#endif
    }
}

/******************************************************************************/
//
// Start of code to process standard requests (USB chapter 9).
//

// Process GET_DESCRIPTOR.

static void GetDescriptor(void){

#ifdef DEBUG_PRINT
    printf("GetDescriptor\r\n");
#endif

    if(SetupPacket.bmRequestType == 0x80){
        unsigned char descriptorType  = SetupPacket.wValue1;
        unsigned char descriptorIndex = SetupPacket.wValue0;
        if (descriptorType == DEVICE_DESCRIPTOR){
#ifdef DEBUG_PRINT
                printf("DEVICE_DESCRIPTOR\r\n");
#endif
                requestHandled = 1;
                ROMoutPtr = (code unsigned char *)&deviceDescriptor;
                wCount = DEVICE_DESCRIPTOR_SIZE;
		transferType=1;
        }else if (descriptorType == CONFIGURATION_DESCRIPTOR){
                requestHandled = 1;
                ROMoutPtr = (code unsigned char *)&configDescriptor;
                wCount = CFSZ;
		transferType=1;
#ifdef DEBUG_PRINT
                printf("CONFIGURATION_DESCRIPTOR: %d\r\n", descriptorIndex);
                printf("Total config size: %d\r\n", wCount);
#endif

        }else if (descriptorType == STRING_DESCRIPTOR){
#ifdef DEBUG_PRINT
                printf("STRING_DESCRIPTOR: %d\r\n", (word)descriptorIndex);
#endif
                requestHandled = 1;
                if (descriptorIndex == 0){
                    ROMoutPtr = (code unsigned char *) &stringDescriptor0;
                }else if (descriptorIndex == 1){
                    ROMoutPtr = (code unsigned char *)&stringDescriptor1;
                }else if (descriptorIndex == 2){
                    ROMoutPtr = (code unsigned char *)&stringDescriptor2;
                }else{
                    ROMoutPtr = (code unsigned char *)&stringDescriptor3;
                }
                wCount = *ROMoutPtr;
		transferType=1;
        }else{
#ifdef DEBUG_PRINT
                printf("Unknown Descriptor: 0x%ux\r\n", (word)descriptorType);
#endif
        }
    }
}

/******************************************************************************/
// Process GET_STATUS.

static void GetStatus(void){
    // Mask off the Recipient bits
    unsigned char recipient = SetupPacket.bmRequestType & 0x1F;
#ifdef DEBUG_PRINT
    printf("GetStatus\r\n");
#endif
    controlTransferBuffer[0] = 0;
    controlTransferBuffer[1] = 0;
    // See where the request goes
    if (recipient == 0x00){
        // Device
        requestHandled = 1;
        // Set bits for self powered device and remote wakeup.
        if (selfPowered){
            controlTransferBuffer[0] |= 0x01;
        }
        if (remoteWakeup){
            controlTransferBuffer[0] |= 0x02;
        }
    }else if (recipient == 0x01){
        // Interface
        requestHandled = 1;
    }
    else if (recipient == 0x02){
        // Endpoint
        unsigned char endpointNum = SetupPacket.wIndex0 & 0x0F;
        unsigned char endpointDir = SetupPacket.wIndex0 & 0x80;
        requestHandled = 1;
        // Endpoint descriptors are 8 bytes long, with each in and out taking 4 bytes
        // within the endpoint. (See PIC datasheet.)
        inPtr = (unsigned char *)&ep0Bo + (endpointNum * 8);
        if (endpointDir){
            inPtr += 4;
        }
        if(*inPtr & BSTALL){
            controlTransferBuffer[0] = 0x01;
        }
    }

    if (requestHandled){
        outPtr = (unsigned char *)&controlTransferBuffer;
        wCount = 2;
	transferType=0;
    }
}

/******************************************************************************/
// Process SET_FEATURE and CLEAR_FEATURE.

static void SetFeature(void){
    unsigned char recipient = SetupPacket.bmRequestType & 0x1F;
    unsigned char feature = SetupPacket.wValue0;
#ifdef DEBUG_PRINT
    printf("SetFeature\r\n");
#endif
    if (recipient == 0x00){
        // Device
        if (feature == DEVICE_REMOTE_WAKEUP){
            requestHandled = 1;
            if (SetupPacket.bRequest == SET_FEATURE){
                remoteWakeup = 1;
            }else{
                remoteWakeup = 0;
            }
        }
        // TBD: Handle TEST_MODE
    }else if (recipient == 0x02){
        // Endpoint
        unsigned char endpointNum = SetupPacket.wIndex0 & 0x0F;
        unsigned char endpointDir = SetupPacket.wIndex0 & 0x80;
        if ((feature == ENDPOINT_HALT) && (endpointNum != 0)){
            // Halt endpoint (as long as it isn't endpoint 0)
            requestHandled = 1;
            // Endpoint descriptors are 8 bytes long, with each in and out taking 4 bytes
            // within the endpoint. (See PIC datasheet.)
            inPtr = (unsigned char *)&ep0Bo + (endpointNum * 8);
            if (endpointDir){
                inPtr += 4;
            }
            if(SetupPacket.bRequest == SET_FEATURE){
                *inPtr = 0x84;
            }else{
                if(endpointDir == 1){
                    *inPtr = 0x00;
                }else{
                    *inPtr = 0x88;
                }
            }
        }
    }
}

/******************************************************************************/

void ProcessStandardRequest(void){
    unsigned char request = SetupPacket.bRequest;

    if((SetupPacket.bmRequestType & 0x60) != 0x00){
        // Not a standard request - don't process here.  Class or Vendor
        // requests have to be handled seperately.
        return;
    }
    if (request == SET_ADDRESS){
            // Set the address of the device.  All future requests
            // will come to that address.  Can't actually set UADDR
            // to the new address yet because the rest of the SET_ADDRESS
            // transaction uses address 0.
#ifdef DEBUG_PRINT
            printf("SET_ADDRESS: %uhx\r\n", SetupPacket.wValue0);
#endif
            requestHandled = 1;
            deviceState = ADDRESS;
            deviceAddress = SetupPacket.wValue0;
    }else if (request == GET_DESCRIPTOR){
            GetDescriptor();
    }else if (request == SET_CONFIGURATION){
#ifdef DEBUG_PRINT
            printf("SET_CONFIGURATION\r\n");
#endif
            requestHandled = 1;
            currentConfiguration = SetupPacket.wValue0;
            // TBD: ensure the new configuration value is one that
            // exists in the descriptor.
            if (currentConfiguration == 0){
                // If configuration value is zero, device is put in
                // address state (USB 2.0 - 9.4.7)
                deviceState = ADDRESS;
            }else{
                // Set the configuration.
                deviceState = CONFIGURED;
                // Initialize the endpoints for all interfaces
                HIDInitEndpoint();
                // TBD: Add initialization code here for any additional
                // interfaces beyond the one used for the HID
            }
    }else if (request == GET_CONFIGURATION){
#ifdef DEBUG_PRINT
            printf("GET_CONFIGURATION\r\n");
#endif
            requestHandled = 1;
            outPtr = (unsigned char*)&currentConfiguration;
            wCount = 1;
	    transferType=0;
    }else if (request == GET_STATUS){
            GetStatus();
    }else if ((request == CLEAR_FEATURE) ||
        (request == SET_FEATURE)){
            SetFeature();
    }else if (request == GET_INTERFACE){
            // No support for alternate interfaces.  Send
            // zero back to the host.
#ifdef DEBUG_PRINT
            printf("GET_INTERFACE\r\n");
#endif
            requestHandled = 1;
            controlTransferBuffer[0] = 0;
            outPtr = (data unsigned char *)&controlTransferBuffer;
            wCount = 1;
            transferType=0;
    }else if (request == SET_INTERFACE){
            // No support for alternate interfaces - just ignore.
#ifdef DEBUG_PRINT
            printf("SET_INTERFACE\r\n");
#endif
            requestHandled = 1;
    }else if (request == SET_DESCRIPTOR){
#ifdef DEBUG_PRINT
            printf("SET_DESCRIPTOR\r\n");
#endif
    }else if (request == SYNCH_FRAME){
#ifdef DEBUG_PRINT
            printf("SYNCH_FRAME\r\n");
#endif
    }else{
#ifdef DEBUG_PRINT
            printf("Default Std Request\r\n");
#endif
    }
}

/******************************************************************************/
// Data stage for a Control Transfer that sends data to the host.

void InDataStage(void){
#if !USE_MEMCPY
    unsigned char i;
#endif
    unsigned int bufferSize;
    // Determine how many bytes are going to the host
    if(wCount < E0SZ){
        bufferSize = wCount;
    }else{
        bufferSize = E0SZ;
    }
#ifdef DEBUG_PRINT
    printf("USBCtrlTrfTxService: %d\r\n", byte_to_send);
#endif
    // Load the high two bits of the byte count into BC8:BC9
    ep0Bi.Stat &= ~(BC8 | BC9); // Clear BC8 and BC9
    ep0Bi.Stat |= (unsigned char)((bufferSize & 0x0300) >> 8);
    ep0Bi.Cnt = (unsigned char)(bufferSize & 0xFF);
    ep0Bi.ADDR = PTR16(&controlTransferBuffer);
    // Update the number of bytes that still need to be sent.  Getting
    // all the data back to the host can take multiple transactions, so
    // we need to track how far along we are.
    wCount = wCount - bufferSize; 
    // Move data to the USB output buffer from wherever it sits now.
    inPtr = (unsigned char *)&controlTransferBuffer;
    if(transferType==1) {
         for(i=0;i<bufferSize;i++){
              *inPtr++ = *ROMoutPtr++;
         }
    }else{
        for(i=0;i<bufferSize;i++){
             *inPtr++ = *outPtr++;
        }
    }

