nickless81/usb_toolbox/scilab6-dev/PIC18F4550/HID/src/usb.c
}

/******************************************************************************/
// Data stage for a Control Transfer that reads data from the host.

void OutDataStage(void){
    unsigned int i, bufferSize;
    bufferSize = ((0x03 & ep0Bo.Stat) << 8) | ep0Bo.Cnt;
#ifdef DEBUG_PRINT
    printf("OutDataStage: %d\r\n", bufferSize);
#endif
    // Accumulate total number of bytes read
    wCount = wCount + bufferSize;   
    outPtr = (unsigned char*)&controlTransferBuffer;
#if USE_MEMCPY
    memcpy(inPtr, outPtr, bufferSize);
#else
    for (i=0;i<bufferSize;i++){
#ifdef DEBUG_PRINT
        printf("0x%x = 0x%x (0x%uhx) ", PTR16(inPtr), PTR16(outPtr), *outPtr);
#endif
        *inPtr++ = *outPtr++;
    }
#ifdef DEBUG_PRINT
    printf("\r\n");
#endif

#endif
}

/******************************************************************************/
// Process the Setup stage of a control transfer.  This code initializes the
// flags that let the firmware know what to do during subsequent stages of
// the transfer.

void SetupStage(void){
    // Note: Microchip says to turn off the UOWN bit on the IN direction as
    // soon as possible after detecting that a SETUP has been received.
    ep0Bi.Stat &= ~UOWN;
    ep0Bo.Stat &= ~UOWN;
    // Initialize the transfer process
    ctrlTransferStage = SETUP_STAGE;
    requestHandled = 0; // Default is that request hasn't been handled
    HIDPostProcess = 0; // Assume standard request until know otherwise
    wCount = 0;         // No bytes transferred
    // See if this is a standard (as definded in USB chapter 9) request
    ProcessStandardRequest();
    // See if the HID class can do something with it.
    ProcessHIDRequest();
    // TBD: Add handlers for any other classes/interfaces in the device
    if (!requestHandled){
        // If this service wasn't handled then stall endpoint 0
        ep0Bo.Cnt = E0SZ;
        ep0Bo.ADDR = PTR16(&SetupPacket);
        ep0Bo.Stat = UOWN | BSTALL;
        ep0Bi.Stat = UOWN | BSTALL;
    }else if (SetupPacket.bmRequestType & 0x80){
        // Device-to-host
        if(SetupPacket.wLength < wCount){
            wCount = SetupPacket.wLength;
        }
        InDataStage();
        ctrlTransferStage = DATA_IN_STAGE;
        // Reset the out buffer descriptor for endpoint 0
        ep0Bo.Cnt = E0SZ;
        ep0Bo.ADDR = PTR16(&SetupPacket);
        ep0Bo.Stat = UOWN;
        // Set the in buffer descriptor on endpoint 0 to send data
        ep0Bi.ADDR = PTR16(&controlTransferBuffer);
        // Give to SIE, DATA1 packet, enable data toggle checks
        ep0Bi.Stat = UOWN | DTS | DTSEN; 
    }else{
        // Host-to-device
        ctrlTransferStage = DATA_OUT_STAGE;
        // Clear the input buffer descriptor
        ep0Bi.Cnt = 0;
        ep0Bi.Stat = UOWN | DTS | DTSEN;
        // Set the out buffer descriptor on endpoint 0 to receive data
        ep0Bo.Cnt = E0SZ;
        ep0Bo.ADDR = PTR16(&controlTransferBuffer);
        // Give to SIE, DATA1 packet, enable data toggle checks
        ep0Bo.Stat = UOWN | DTS | DTSEN;
    }
    // Enable SIE token and packet processing
    UCONbits.PKTDIS = 0;
}

/******************************************************************************/
// Configures the buffer descriptor for endpoint 0 so that it is waiting for
// the status stage of a control transfer.

void WaitForSetupStage(void){
    ctrlTransferStage = SETUP_STAGE;
    ep0Bo.Cnt = E0SZ;
    ep0Bo.ADDR = PTR16(&SetupPacket);
    ep0Bo.Stat = UOWN | DTSEN; // Give to SIE, enable data toggle checks
    ep0Bi.Stat = 0x00;         // Give control to CPU
}

/******************************************************************************/
// This is the starting point for processing a Control Transfer.  The code directly
// follows the sequence of transactions described in the USB spec chapter 5.  The
// only Control Pipe in this firmware is the Default Control Pipe (endpoint 0).
// Control messages that have a different destination will be discarded.

void ProcessControlTransfer(void){   
#ifdef DEBUG_PRINT
    printf("ProcessControlTransfer\r\n");
#endif
    if (USTAT == 0){
        // Endpoint 0:out
        unsigned char PID = (ep0Bo.Stat & 0x3C) >> 2; // Pull PID from middle of BD0STAT
        if (PID == 0x0D){
            // SETUP PID - a transaction is starting
            SetupStage();
        }else if (ctrlTransferStage == DATA_OUT_STAGE){
            // Complete the data stage so that all information has
            // passed from host to device before servicing it.
            OutDataStage();
            // If this is a HID request, then invoke the callback to handle
            // the control out (when necessary).
            if (HIDPostProcess){
                // Determine which report is being set.
                unsigned char reportID = SetupPacket.wValue0;
                // Find out if an Output or Feature report has arrived on the control pipe.
                // Get the report type from the Setup packet.
                if (SetupPacket.wValue1 == 0x02){
                    // Output report
                    SetOutputReport(reportID);
                }else if (SetupPacket.wValue1 == 0x03){
                    // Feature report
                    SetFeatureReport(reportID);
                }else{
                    // Unknown report type
                }
            }
            // Turn control over to the SIE and toggle the data bit
            if(ep0Bo.Stat & DTS){
                ep0Bo.Stat = UOWN | DTSEN;
            }else{
                ep0Bo.Stat = UOWN | DTS | DTSEN;
            }
        }else{
            // Prepare for the Setup stage of a control transfer
            WaitForSetupStage();
        }
    }else if(USTAT == 0x04){
        // Endpoint 0:in
        if ((UADDR == 0) && (deviceState == ADDRESS)){
            // TBD: ensure that the new address matches the value of
            // "deviceAddress" (which came in through a SET_ADDRESS).
            UADDR = SetupPacket.wValue0;
#ifdef DEBUG_PRINT
            printf("UADDR = 0x%x\r\n", (word)UADDR);
#endif
            if(UADDR == 0){
                // If we get a reset after a SET_ADDRESS, then we need
                // to drop back to the Default state.
                deviceState = DEFAULT;
            }
        }

        if (ctrlTransferStage == DATA_IN_STAGE){
            // Start (or continue) transmitting data
            InDataStage();
            // Turn control over to the SIE and toggle the data bit
            if(ep0Bi.Stat & DTS){
                ep0Bi.Stat = UOWN | DTSEN;
            }else{
                ep0Bi.Stat = UOWN | DTS | DTSEN;
            }
        }else{
            // Prepare for the Setup stage of a control transfer
            WaitForSetupStage();
        }
    }else{
#ifdef DEBUG_PRINT
        printf("USTAT = 0x%uhx\r\n", USTAT);
#endif
    }
}

/******************************************************************************/

void EnableUSBModule(void){
    // TBD: Check for voltage coming from the USB cable and use that
    // as an indication we are attached.
    if(UCONbits.USBEN == 0){
#ifdef DEBUG_PRINT
        printf("Enable the module\r\n");
#endif
        UCON = 0;
        UIE = 0;
        UCONbits.USBEN = 1;
        deviceState = ATTACHED;
    }
    // If we are attached and no single-ended zero is detected, then
    // we can move to the Powered state.
    if ((deviceState == ATTACHED) && !UCONbits.SE0){
        UIR = 0;
        UIE = 0;
        UIEbits.URSTIE = 1;
        UIEbits.IDLEIE = 1;
        deviceState = POWERED;
#ifdef DEBUG_PRINT
        printf("Device powered\r\n");
#endif
    }
}

/******************************************************************************/
// Unsuspend the device.

void UnSuspend(void){
#ifdef DEBUG_PRINT
    printf("UnSuspend\r\n");
#endif
    UCONbits.SUSPND = 0;
    UIEbits.ACTVIE = 0;
    UIRbits.ACTVIF = 0;
}

/******************************************************************************/
// Full speed devices get a Start Of Frame (SOF) packet every 1 millisecond.
// Nothing is currently done with this interrupt (it is simply masked out).

void StartOfFrame(void){
    // TBD: Add a callback routine to do something
    UIRbits.SOFIF = 0;
}

/******************************************************************************/
// This routine is called in response to the code stalling an endpoint.

void Stall(void){
#ifdef DEBUG_PRINT
   printf("Stall\r\n");
#endif
    if(UEP0bits.EPSTALL == 1){
        // Prepare for the Setup stage of a control transfer
        WaitForSetupStage();
        UEP0bits.EPSTALL = 0;
    }
    UIRbits.STALLIF = 0;
}

/******************************************************************************/
// Suspend all processing until we detect activity on the USB bus.

void Suspend(void){
#if ALLOW_SUSPEND
#ifdef DEBUG_PRINT
    printf("Suspend\r\n");
#endif
    UIEbits.ACTVIE = 1;
    UIRbits.IDLEIF = 0;
    UCONbits.SUSPND = 1;

    PIR2bits.USBIF = 0;
    INTCONbits.RBIF = 0;
    PIE2bits.USBIE = 1;
    INTCONbits.RBIE = 1;

    // disable the USART
    RCSTAbits.CREN = 0;
    TXSTAbits.TXEN = 0;

    Sleep();

    // enable the USART
    RCSTAbits.CREN = 1;
    TXSTAbits.TXEN = 1;

    PIE2bits.USBIE = 0;
    INTCONbits.RBIE = 0;
#endif
}

/******************************************************************************/

void BusReset(){
    UEIR  = 0x00;
    UIR   = 0x00;
    UEIE  = 0x9f;
    UIE   = 0x7b;
    UADDR = 0x00;
    // Set endpoint 0 as a control pipe
    UEP0 = 0x16;
    // Flush any pending transactions
    while (UIRbits.TRNIF == 1){
        UIRbits.TRNIF = 0;
    }

