nickless81/usb_toolbox/scilab6-dev/PIC18F4550/HID/src/usb.c
    // Enable packet processing
    UCONbits.PKTDIS = 0;
    // Prepare for the Setup stage of a control transfer
    WaitForSetupStage();
    remoteWakeup = 0;         // Remote wakeup is off by default
    selfPowered = 0;          // Self powered is off by default
    currentConfiguration = 0; // Clear active configuration
    deviceState = DEFAULT;
}

/******************************************************************************/
// Main entry point for USB tasks.  Checks interrupts, then checks for transactions.

void ProcessUSBTransactions(void){   
    // See if the device is connected yet.
    if(deviceState == DETACHED){
        return;
    }
    
    // If the USB became active then wake up from suspend
    if(UIRbits.ACTVIF && UIEbits.ACTVIE){
        UnSuspend();
    }

    // If we are supposed to be suspended, then don't try performing any
    // processing.
    if(UCONbits.SUSPND == 1){
        return;
    }
     // Process a bus reset
    if (UIRbits.URSTIF && UIEbits.URSTIE){
        BusReset();
    }
    
    if (UIRbits.IDLEIF && UIEbits.IDLEIE){
        // No bus activity for a while - suspend the firmware
        Suspend();
    }
    if (UIRbits.SOFIF && UIEbits.SOFIE){
        StartOfFrame();
    }
    if (UIRbits.STALLIF && UIEbits.STALLIE){
        Stall();
    }

    if (UIRbits.UERRIF && UIEbits.UERRIE){
        // TBD: See where the error came from.
        // Clear errors
        UIRbits.UERRIF = 0;
    }

    // Unless we have been reset by the host, no need to keep processing
    if (deviceState < DEFAULT){
        return;
    }

    // A transaction has finished.  Try default processing on endpoint 0.
    if(UIRbits.TRNIF && UIEbits.TRNIE){
        ProcessControlTransfer();        
        // Turn off interrupt
        UIRbits.TRNIF = 0;
    }
}
